# Ethan's Notebook

## Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline
pd.set_option('display.max_columns', 500)
plt.style.use('fivethirtyeight')

## Load Data

In [2]:
df_gender_submission = pd.read_csv('../data/gender_submission.csv')
display(df_gender_submission.head())
df_gender_submission.info()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [3]:
df_test = pd.read_csv('../data/test.csv')
display(df_test.head())
df_test.info()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [4]:
df_train = pd.read_csv('../data/train.csv')
display(df_train.head())
df_train.info()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## EDA | Cleaning | Feature Engineering

In [5]:
df_combined = pd.concat([df_train, df_test])
df_combined.rename(columns={'SibSp':'num_siblings_spouses_aboard', 'Parch':'num_parents_children_aboard', 'Ticket':'ticket_number', 'Pclass':'ticket_class'}, inplace=True)
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   PassengerId                  1309 non-null   int64
 1   Survived                     891 non-null    float64
 2   ticket_class                 1309 non-null   int64
 3   Name                         1309 non-null   object
 4   Sex                          1309 non-null   object
 5   Age                          1046 non-null   float64
 6   num_siblings_spouses_aboard  1309 non-null   int64
 7   num_parents_children_aboard  1309 non-null   int64
 8   ticket_number                1309 non-null   object
 9   Fare                         1308 non-null   float64
 10  Cabin                        295 non-null    object
 11  Embarked                     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [6]:
df_combined['PassengerId'].value_counts().max()

np.int64(1)

No dupes after concat whoop whoop

In [7]:
df_combined.describe()

,PassengerId,Survived,ticket_class,Age,num_siblings_spouses_aboard,num_parents_children_aboard,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [8]:
df_combined.sample(20)

,PassengerId,Survived,ticket_class,Name,Sex,Age,num_siblings_spouses_aboard,num_parents_children_aboard,ticket_number,Fare,Cabin,Embarked
73,74,0.0,3,"Chronopoulos, Mr. Apostolos",male,26.00,1,0,2680,14.4542,NaN,C
691,692,1.0,3,"Karun, Miss. Manca",female,4.00,0,1,349256,13.4167,NaN,C
741,742,0.0,1,"Cavendish, Mr. Tyrell William",male,36.00,1,0,19877,78.8500,C46,S
318,319,1.0,1,"Wick, Miss. Mary Natalie",female,31.00,0,2,36928,164.8667,C7,S
755,756,1.0,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
277,1169,NaN,2,"Faunthorpe, Mr. Harry",male,40.00,1,0,2926,26.0000,NaN,S
21,22,1.0,2,"Beesley, Mr. Lawrence",male,34.00,0,0,248698,13.0000,D56,S
155,1047,NaN,3,"Duquemin, Mr. Joseph",male,24.00,0,0,S.O./P.P. 752,7.5500,NaN,S
341,1233,NaN,3,"Lundstrom, Mr. Thure Edvin",male,32.00,0,0,350403,7.5792,NaN,S
594,595,0.0,2,"Chapman, Mr. John Henry",male,37.00,1,0,SC/AH 29037,26.0000,NaN,S
161,162,1.0,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.00,0,0,C.A. 33595,15.7500,NaN,S
696,697,0.0,3,"Kelly, Mr. James",male,44.00,0,0,363592,8.0500,NaN,S
368,1260,NaN,1,"Gibson, Mrs. Leonard (Pauline C Boeson)",female,45.00,0,1,112378,59.4000,NaN,C
86,87,0.0,3,"Ford, Mr. William Neal",male,16.00,1,3,W./C. 6608,34.3750,NaN,S
842,843,1.0,1,"Serepeca, Miss. Augusta",female,30.00,0,0,113798,31.0000,NaN,C
139,140,0.0,1,"Giglio, Mr. Victor",male,24.00,0,0,PC 17593,79.2000,B86,C
396,397,0.0,3,"Olsson, Miss. Elina",female,31.00,0,0,350407,7.8542,NaN,S
153,154,0.0,3,"van Billiard, Mr. Austin Blyler",male,40.50,0,2,A/5. 851,14.5000,NaN,S
313,1205,NaN,3,"Carr, Miss. Jeannie",female,37.00,0,0,368364,7.7500,NaN,Q
857,858,1.0,1,"Daly, Mr. Peter Denis",male,51.00,0,0,113055,26.5500,E17,S

### Embarked

In [9]:
df_combined['Embarked'].value_counts(dropna=False)

Embarked
S      914
C      270
Q      123
NaN      2
Name: count, dtype: int64

In [10]:
df_combined[df_combined['Embarked'].isna()]

,PassengerId,Survived,ticket_class,Name,Sex,Age,num_siblings_spouses_aboard,num_parents_children_aboard,ticket_number,Fare,Cabin,Embarked
61,62,1.0,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1.0,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [11]:
df_combined[df_combined["Cabin"].str.contains("B", na=False) & ~df_combined["ticket_number"].str.contains("PC", na=False)]['Embarked'].value_counts()

Embarked
S    31
C    11
Name: count, dtype: int64

2/3 of those ticket types for cabin B were S so let's slot them in there.

In [12]:
df_combined['Embarked'] = df_combined['Embarked'].fillna('S')
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   PassengerId                  1309 non-null   int64
 1   Survived                     891 non-null    float64
 2   ticket_class                 1309 non-null   int64
 3   Name                         1309 non-null   object
 4   Sex                          1309 non-null   object
 5   Age                          1046 non-null   float64
 6   num_siblings_spouses_aboard  1309 non-null   int64
 7   num_parents_children_aboard  1309 non-null   int64
 8   ticket_number                1309 non-null   object
 9   Fare                         1308 non-null   float64
 10  Cabin                        295 non-null    object
 11  Embarked                     1309 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [13]:
df_combined['Embarked'].value_counts()

Embarked
S    916
C    270
Q    123
Name: count, dtype: int64

Majority are S anyways wow

### Fare

In [14]:
df_combined[df_combined['Fare'].isna()]

,PassengerId,Survived,ticket_class,Name,Sex,Age,num_siblings_spouses_aboard,num_parents_children_aboard,ticket_number,Fare,Cabin,Embarked
152,1044,NaN,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

In [15]:
median_fare = df_combined[(df_combined['Age']>=40) & (df_combined['ticket_class']==3) & (df_combined['Embarked'] == 'S') & (df_combined['num_siblings_spouses_aboard'] == 0) & (df_combined['num_parents_children_aboard'] == 0)]['Fare'].median()
print(median_fare)

7.8542

Filling the na with the median of those that are old, 0 family aboard, embarked from S, and were ticket class 3.

In [16]:
df_combined['Fare'] = df_combined['Fare'].fillna(median_fare)
df_combined.describe()

,PassengerId,Survived,ticket_class,Age,num_siblings_spouses_aboard,num_parents_children_aboard,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1309.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.276044
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.743657
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [17]:
df_combined[df_combined['Fare']==0.0]

,PassengerId,Survived,ticket_class,Name,Sex,Age,num_siblings_spouses_aboard,num_parents_children_aboard,ticket_number,Fare,Cabin,Embarked
179,180,0.0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0.0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1.0,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
277,278,0.0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
302,303,0.0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
413,414,0.0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
466,467,0.0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S
481,482,0.0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
597,598,0.0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
633,634,0.0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
674,675,0.0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S
732,733,0.0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S
806,807,0.0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
815,816,0.0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
822,823,0.0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S
266,1158,NaN,1,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,0,0,112051,0.0,NaN,S
372,1264,NaN,1,"Ismay, Mr. Joseph Bruce",male,49.0,0,0,112058,0.0,B52 B54 B56,S

Weird

In [18]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   PassengerId                  1309 non-null   int64
 1   Survived                     891 non-null    float64
 2   ticket_class                 1309 non-null   int64
 3   Name                         1309 non-null   object
 4   Sex                          1309 non-null   object
 5   Age                          1046 non-null   float64
 6   num_siblings_spouses_aboard  1309 non-null   int64
 7   num_parents_children_aboard  1309 non-null   int64
 8   ticket_number                1309 non-null   object
 9   Fare                         1309 non-null   float64
 10  Cabin                        295 non-null    object
 11  Embarked                     1309 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

### Cabin

In [19]:
df_combined[df_combined['Cabin'].isna() == False]['ticket_class'].value_counts()

ticket_class
1    256
2     23
3     16
Name: count, dtype: int64

In [20]:
df_combined['cabin_was_missing'] = df_combined['Cabin'].isna().astype(int)

In [21]:
df_combined['cabin_deck'] = df_combined['Cabin'].str.extract(r"([A-G])", expand=False)
df_combined['cabin_deck'].value_counts(dropna=False)

cabin_deck
NaN    1015
C        94
B        65
D        46
E        41
A        22
F        21
G         5
Name: count, dtype: int64

In [22]:
df_combined.groupby(['cabin_deck', 'ticket_class'])['Fare'].describe()

                         count        mean         std      min      25%  \
cabin_deck ticket_class
A          1              22.0   41.244314   20.140358   0.0000  30.1250
B          1              65.0  122.383078  115.312993   0.0000  57.0000
C          1              94.0  107.926598   72.912034  25.7000  52.0000
D          1              40.0   58.919065   25.256615  25.9292  33.5958
           2               6.0   13.595833    0.829640  12.8750  13.0000
E          1              34.0   63.464706   35.322753  25.5875  29.5375
           2               4.0   11.587500    1.283469  10.5000  10.5000
           3               3.0   11.000000    2.554775   8.0500  10.2625
F          2              13.0   23.423077   12.306580  10.5000  13.0000
           3               8.0    9.395838    5.241519   7.2292   7.5448
G          3               5.0   14.205000    3.416419  10.4625  10.4625

                              50%         75%       max
cabin_deck ticket_class
A          1             35.07710   50.371850   81.8583
B          1             82.26670  146.520800  512.3292
C          1             86.28960  151.550000  263.0000
D          1             53.10000   76.868775  113.2750
           2             13.39585   13.844800   15.0458
E          1             55.44170   79.650000  134.5000
           2             11.42500   12.512500   13.0000
           3             12.47500   12.475000   12.4750
F          2             26.00000   39.000000   39.0000
           3              7.65000    7.675000   22.3583
G          3             16.70000   16.700000   16.7000

In [23]:
df_cabin = df_combined.copy()
df_cabin['log_fare'] = np.log1p(df_cabin["Fare"])

In [24]:
df_has_cabin_and_fare = df_cabin[df_cabin['cabin_deck'].notna() & df_cabin['Fare'].notna()]
df_no_cabin = df_cabin[df_cabin['cabin_deck'].isna()].copy()

In [25]:
deck_means = (df_has_cabin_and_fare.groupby(['ticket_class', 'cabin_deck'])['log_fare'].mean())

In [26]:
def assign_deck(row):
    if row['ticket_class'] not in deck_means.index.get_level_values(0): return np.nan

    class_means = deck_means.loc[row['ticket_class']]
    closest_deck = (class_means - row['log_fare']).abs().idxmin()
    return closest_deck

df_no_cabin['cabin_deck_assumed'] = df_no_cabin.apply(assign_deck, axis=1)
df_no_cabin['cabin_deck_assumed']

0      F
2      F
4      F
5      F
7      G
      ..
412    F
413    F
415    F
416    F
417    G
Name: cabin_deck_assumed, Length: 1015, dtype: object

In [27]:
df_combined.loc[df_combined['cabin_deck'].isna(), 'cabin_deck'] = df_no_cabin['cabin_deck_assumed']

In [28]:
df_combined['cabin_deck'].value_counts(dropna=False)

cabin_deck
F    608
G    220
D    133
E    111
C    110
B     68
A     59
Name: count, dtype: int64

In [29]:
df_combined[df_combined['Cabin'].isna()].sample(8)

,PassengerId,Survived,ticket_class,Name,Sex,Age,num_siblings_spouses_aboard,num_parents_children_aboard,ticket_number,Fare,Cabin,Embarked,cabin_was_missing,cabin_deck
277,1169,NaN,2,"Faunthorpe, Mr. Harry",male,40.0,1,0,2926,26.0000,NaN,S,1,F
589,590,0.0,3,"Murdlin, Mr. Joseph",male,NaN,0,0,A./5. 3235,8.0500,NaN,S,1,F
800,801,0.0,2,"Ponesell, Mr. Martin",male,34.0,0,0,250647,13.0000,NaN,S,1,D
758,759,0.0,3,"Theobald, Mr. Thomas Leonard",male,34.0,0,0,363294,8.0500,NaN,S,1,F
258,259,1.0,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,1,C
529,530,0.0,2,"Hocking, Mr. Richard George",male,23.0,2,1,29104,11.5000,NaN,S,1,E
714,715,0.0,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S,1,D
35,36,0.0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S,1,D

In [30]:
df_combined.drop(columns='Cabin',axis=1,inplace=True)
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   PassengerId                  1309 non-null   int64
 1   Survived                     891 non-null    float64
 2   ticket_class                 1309 non-null   int64
 3   Name                         1309 non-null   object
 4   Sex                          1309 non-null   object
 5   Age                          1046 non-null   float64
 6   num_siblings_spouses_aboard  1309 non-null   int64
 7   num_parents_children_aboard  1309 non-null   int64
 8   ticket_number                1309 non-null   object
 9   Fare                         1309 non-null   float64
 10  Embarked                     1309 non-null   object
 11  cabin_was_missing            1309 non-null   int64
 12  cabin_deck                   1309 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 143.2+ KB

### Family

In [31]:
df_combined['is_alone'] = ((df_combined['num_siblings_spouses_aboard'] == 0) & (df_combined['num_parents_children_aboard'] == 0)).astype(int)
df_combined['is_alone'].value_counts()

is_alone
1    790
0    519
Name: count, dtype: int64

In [32]:
df_combined['has_sibling_spouse_only'] = ((df_combined['num_siblings_spouses_aboard'] > 0) & (df_combined['num_parents_children_aboard'] == 0)).astype(int)
df_combined['has_sibling_spouse_only'].value_counts()

has_sibling_spouse_only
0    1097
1     212
Name: count, dtype: int64

In [33]:
df_combined['has_parents_children_only'] = ((df_combined['num_siblings_spouses_aboard'] == 0) & (df_combined['num_parents_children_aboard'] > 0)).astype(int)
df_combined['has_parents_children_only'].value_counts()

has_parents_children_only
0    1208
1     101
Name: count, dtype: int64

In [34]:
df_combined['has_full_family'] = ((df_combined['num_siblings_spouses_aboard'] > 0) & (df_combined['num_parents_children_aboard'] > 0)).astype(int)
df_combined['has_full_family'].value_counts()

has_full_family
0    1103
1     206
Name: count, dtype: int64

In [35]:
df_combined.drop(columns=['num_siblings_spouses_aboard', 'num_parents_children_aboard'],axis=1,inplace=True)
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 15 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   PassengerId                1309 non-null   int64
 1   Survived                   891 non-null    float64
 2   ticket_class               1309 non-null   int64
 3   Name                       1309 non-null   object
 4   Sex                        1309 non-null   object
 5   Age                        1046 non-null   float64
 6   ticket_number              1309 non-null   object
 7   Fare                       1309 non-null   float64
 8   Embarked                   1309 non-null   object
 9   cabin_was_missing          1309 non-null   int64
 10  cabin_deck                 1309 non-null   object
 11  is_alone                   1309 non-null   int64
 12  has_sibling_spouse_only    1309 non-null   int64
 13  has_parents_children_only  1309 non-null   int64
 14  has_full_family            1309 non-null   int64
dtypes: float64(3), int64(7), object(5)
memory usage: 163.6+ KB

In [36]:
df_combined.sample(5)

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family
201,202,0.0,3,"Sage, Mr. Frederick",male,NaN,CA. 2343,69.5500,S,1,G,0,0,0,1
49,941,NaN,3,"Coutts, Mrs. William (Winnie Minnie"" Treanor)""",female,36.0,C.A. 37671,15.9000,S,1,G,0,0,1,0
371,372,0.0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,3101267,6.4958,S,1,F,0,1,0,0
85,977,NaN,3,"Khalil, Mr. Betros",male,NaN,2660,14.4542,C,1,G,0,1,0,0
311,312,1.0,1,"Ryerson, Miss. Emily Borie",female,18.0,PC 17608,262.3750,C,0,B,0,0,0,1

### Age

In [37]:
df_combined['Age'].value_counts(dropna=False)

Age
NaN      263
24.00     47
22.00     43
21.00     41
30.00     40
        ...
60.50      1
11.50      1
0.33       1
0.17       1
38.50      1
Name: count, Length: 99, dtype: int64

In [38]:
df_combined[df_combined['Age']<1]

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family
78,79,1.0,2,"Caldwell, Master. Alden Gates",male,0.83,248738,29.0000,S,1,F,0,0,1,0
305,306,1.0,1,"Allison, Master. Hudson Trevor",male,0.92,113781,151.5500,S,0,C,0,0,0,1
469,470,1.0,3,"Baclini, Miss. Helene Barbara",female,0.75,2666,19.2583,C,1,G,0,0,0,1
644,645,1.0,3,"Baclini, Miss. Eugenie",female,0.75,2666,19.2583,C,1,G,0,0,0,1
755,756,1.0,2,"Hamalainen, Master. Viljo",male,0.67,250649,14.5000,S,1,D,0,0,0,1
803,804,1.0,3,"Thomas, Master. Assad Alexander",male,0.42,2625,8.5167,C,1,F,0,0,1,0
831,832,1.0,2,"Richards, Master. George Sibley",male,0.83,29106,18.7500,S,1,F,0,0,0,1
201,1093,NaN,3,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,347080,14.4000,S,1,G,0,0,1,0
250,1142,NaN,2,"West, Miss. Barbara J",female,0.92,C.A. 34651,27.7500,S,1,F,0,0,0,1
281,1173,NaN,3,"Peacock, Master. Alfred Edward",male,0.75,SOTON/O.Q. 3101315,13.7750,S,1,G,0,0,0,1
307,1199,NaN,3,"Aks, Master. Philip Frank",male,0.83,392091,9.3500,S,1,F,0,0,1,0
354,1246,NaN,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,C.A. 2315,20.5750,S,1,G,0,0,0,1

In [39]:
df_combined[df_combined['Age'].isna()]

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family
5,6,0.0,3,"Moran, Mr. James",male,NaN,330877,8.4583,Q,1,F,1,0,0,0
17,18,1.0,2,"Williams, Mr. Charles Eugene",male,NaN,244373,13.0000,S,1,D,1,0,0,0
19,20,1.0,3,"Masselmani, Mrs. Fatima",female,NaN,2649,7.2250,C,1,F,1,0,0,0
26,27,0.0,3,"Emir, Mr. Farred Chehab",male,NaN,2631,7.2250,C,1,F,1,0,0,0
28,29,1.0,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,330959,7.8792,Q,1,F,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
408,1300,NaN,3,"Riordan, Miss. Johanna Hannah""""",female,NaN,334915,7.7208,Q,1,F,1,0,0,0
410,1302,NaN,3,"Naughton, Miss. Hannah",female,NaN,365237,7.7500,Q,1,F,1,0,0,0
413,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,A.5. 3236,8.0500,S,1,F,1,0,0,0
416,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,359309,8.0500,S,1,F,1,0,0,0
417,1309,NaN,3,"Peter, Master. Michael J",male,NaN,2668,22.3583,C,1,G,0,0,0,1

In [40]:
df_combined['age_was_missing'] = df_combined['Age'].isna().astype(int)

In [41]:
df_combined[df_combined['Age'].isna()]['ticket_class'].value_counts()

ticket_class
3    208
1     39
2     16
Name: count, dtype: int64

Not good to just drop them all

In [42]:
age_medians = (df_combined.groupby(['ticket_class', 'Sex'])['Age'].median())
age_medians

ticket_class  Sex
1             female    36.0
              male      42.0
2             female    28.0
              male      29.5
3             female    22.0
              male      25.0
Name: Age, dtype: float64

In [43]:
df_combined.groupby(['ticket_class','Sex'])['Age'].describe()

                     count       mean        std   min   25%   50%    75%  \
ticket_class Sex
1            female  133.0  37.037594  14.272460  2.00  24.0  36.0  48.00
             male    151.0  41.029272  14.578529  0.92  30.0  42.0  50.00
2            female  103.0  27.499223  12.911747  0.92  20.0  28.0  34.00
             male    158.0  30.815380  13.977400  0.67  23.0  29.5  38.75
3            female  152.0  22.185329  12.205254  0.17  16.0  22.0  30.00
             male    349.0  25.962264  11.682415  0.33  20.0  25.0  32.00

                      max
ticket_class Sex
1            female  76.0
             male    80.0
2            female  60.0
             male    70.0
3            female  63.0
             male    74.0

In [44]:
df_combined['Age'] = df_combined['Age'].fillna(df_combined.groupby(['ticket_class', 'Sex'])['Age'].transform('median'))

In [45]:
df_combined['is_baby'] = df_combined['Age'].between(0, 2, inclusive='both').astype(int)
df_combined['is_child'] = df_combined['Age'].between(3, 12, inclusive='both').astype(int)
df_combined['is_teen'] = df_combined['Age'].between(13, 19, inclusive='both').astype(int)
df_combined['is_young_adult'] = df_combined['Age'].between(20, 35, inclusive='both').astype(int)
df_combined['is_adult'] = df_combined['Age'].between(36, 60, inclusive='both').astype(int)
df_combined['is_senior'] = (df_combined['Age'] >= 61).astype(int)

In [46]:
df_combined.sample(5)

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family,age_was_missing,is_baby,is_child,is_teen,is_young_adult,is_adult,is_senior
709,710,1.0,3,"Moubarek, Master. Halim Gonios (""William George"")",male,25.0,2661,15.2458,C,1,G,0,0,0,1,1,0,0,0,1,0,0
594,595,0.0,2,"Chapman, Mr. John Henry",male,37.0,SC/AH 29037,26.0000,S,1,F,0,1,0,0,0,0,0,0,0,1,0
77,969,NaN,1,"Cornell, Mrs. Robert Clifford (Malvina Helen L...",female,55.0,11770,25.7000,S,0,C,0,1,0,0,0,0,0,0,0,1,0
194,1086,NaN,2,"Drew, Master. Marshall Brines",male,8.0,28220,32.5000,S,1,F,0,0,1,0,0,0,1,0,0,0,0
269,270,1.0,1,"Bissette, Miss. Amelia",female,35.0,PC 17760,135.6333,S,0,C,1,0,0,0,0,0,0,0,1,0,0

In [47]:
df_combined.groupby(['ticket_class','Sex'])['Age'].describe()

                     count       mean        std   min    25%   50%    75%  \
ticket_class Sex
1            female  144.0  36.958333  13.715325  2.00  25.75  36.0  48.00
             male    179.0  41.181117  13.387543  0.92  32.25  42.0  49.00
2            female  106.0  27.513396  12.726230  0.92  20.25  28.0  34.00
             male    171.0  30.715380  13.436893  0.67  23.00  29.5  36.25
3            female  216.0  22.130417  10.228949  0.17  18.00  22.0  26.00
             male    493.0  25.681197   9.834920  0.33  21.00  25.0  28.50

                      max
ticket_class Sex
1            female  76.0
             male    80.0
2            female  60.0
             male    70.0
3            female  63.0
             male    74.0

Really only pulled the std down by 1 after that fill by putting ~200ish medians into the mix

In [48]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 22 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   PassengerId                1309 non-null   int64
 1   Survived                   891 non-null    float64
 2   ticket_class               1309 non-null   int64
 3   Name                       1309 non-null   object
 4   Sex                        1309 non-null   object
 5   Age                        1309 non-null   float64
 6   ticket_number              1309 non-null   object
 7   Fare                       1309 non-null   float64
 8   Embarked                   1309 non-null   object
 9   cabin_was_missing          1309 non-null   int64
 10  cabin_deck                 1309 non-null   object
 11  is_alone                   1309 non-null   int64
 12  has_sibling_spouse_only    1309 non-null   int64
 13  has_parents_children_only  1309 non-null   int64
 14  has_full_family            1309 non-null   int64
 15  age_was_missing            1309 non-null   int64
 16  is_baby                    1309 non-null   int64
 17  is_child                   1309 non-null   int64
 18  is_teen                    1309 non-null   int64
 19  is_young_adult             1309 non-null   int64
 20  is_adult                   1309 non-null   int64
 21  is_senior                  1309 non-null   int64
dtypes: float64(3), int64(14), object(5)
memory usage: 235.2+ KB

### Final weirdness check

In [49]:
for col in df_combined.columns:
    print("-----------------")
    print(df_combined[col].value_counts(dropna=False))

-----------------
PassengerId
1       1
2       1
3       1
4       1
5       1
       ..
1305    1
1306    1
1307    1
1308    1
1309    1
Name: count, Length: 1309, dtype: int64
-----------------
Survived
0.0    549
NaN    418
1.0    342
Name: count, dtype: int64
-----------------
ticket_class
3    709
1    323
2    277
Name: count, dtype: int64
-----------------
Name
Connolly, Miss. Kate                                               2
Kelly, Mr. James                                                   2
Bonnell, Miss. Elizabeth                                           1
Peter, Master. Michael J                                           1
Braund, Mr. Owen Harris                                            1
                                                                  ..
Frolicher-Stehli, Mrs. Maxmillian (Margaretha Emerentia Stehli)    1
Larsson-Rondberg, Mr. Edvard A                                     1
Conlon, Mr. Thomas Henry                                           1
Bonnell, Miss. Caroline                                            1
Gibson, Miss. Dorothy Winifred                                     1
Name: count, Length: 1307, dtype: int64
-----------------
Sex
male      843
female    466
Name: count, dtype: int64
-----------------
Age
25.00    178
22.00    107
24.00     47
42.00     46
36.00     42
        ...
60.50      1
11.50      1
0.33       1
0.17       1
38.50      1
Name: count, Length: 99, dtype: int64
-----------------
ticket_number
CA. 2343        11
1601             8
CA 2144          8
347082           7
S.O.C. 14879     7
                ..
A.5. 3236        1
347086           1
365237           1
334915           1
28666            1
Name: count, Length: 929, dtype: int64
-----------------
Fare
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
12.7375     1
45.5000     1
7.5750      1
7.5792      1
7.7208      1
Name: count, Length: 281, dtype: int64
-----------------
Embarked
S    916
C    270
Q    123
Name: count, dtype: int64
-----------------
cabin_was_missing
1    1014
0     295
Name: count, dtype: int64
-----------------
cabin_deck
F    608
G    220
D    133
E    111
C    110
B     68
A     59
Name: count, dtype: int64
-----------------
is_alone
1    790
0    519
Name: count, dtype: int64
-----------------
has_sibling_spouse_only
0    1097
1     212
Name: count, dtype: int64
-----------------
has_parents_children_only
0    1208
1     101
Name: count, dtype: int64
-----------------
has_full_family
0    1103
1     206
Name: count, dtype: int64
-----------------
age_was_missing
0    1046
1     263
Name: count, dtype: int64
-----------------
is_baby
0    1275
1      34
Name: count, dtype: int64
-----------------
is_child
0    1249
1      60
Name: count, dtype: int64
-----------------
is_teen
0    1178
1     131
Name: count, dtype: int64
-----------------
is_young_adult
1    723
0    586
Name: count, dtype: int64
-----------------
is_adult
0    981
1    328
Name: count, dtype: int64
-----------------
is_senior
0    1277
1      32
Name: count, dtype: int64

fare had weird decimals

In [50]:
df_combined['Fare'] = df_combined['Fare'].round(2)

11 count under one ticket number. that could be interesting to explore with graphs

In [51]:
df_combined['group_size'] = df_combined.groupby('ticket_number')['ticket_number'].transform('count')

two duplicate names

In [52]:
df_combined[df_combined['Name']=='Connolly, Miss. Kate']

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family,age_was_missing,is_baby,is_child,is_teen,is_young_adult,is_adult,is_senior,group_size
289,290,1.0,3,"Connolly, Miss. Kate",female,22.0,370373,7.75,Q,1,F,1,0,0,0,0,0,0,0,1,0,0,1
6,898,NaN,3,"Connolly, Miss. Kate",female,30.0,330972,7.63,Q,1,F,1,0,0,0,0,0,0,0,1,0,0,1

In [53]:
df_combined[df_combined['Name']=='Kelly, Mr. James']

,PassengerId,Survived,ticket_class,Name,Sex,Age,ticket_number,Fare,Embarked,cabin_was_missing,cabin_deck,is_alone,has_sibling_spouse_only,has_parents_children_only,has_full_family,age_was_missing,is_baby,is_child,is_teen,is_young_adult,is_adult,is_senior,group_size
696,697,0.0,3,"Kelly, Mr. James",male,44.0,363592,8.05,S,1,F,1,0,0,0,0,0,0,0,0,1,0,1
0,892,NaN,3,"Kelly, Mr. James",male,34.5,330911,7.83,Q,1,F,1,0,0,0,0,0,0,0,1,0,0,1

they seem to be normal, different people just same name

In [54]:
for col in df_combined.columns:
    print("-----------------")
    print(df_combined[col].value_counts(dropna=False))

-----------------
PassengerId
1       1
2       1
3       1
4       1
5       1
       ..
1305    1
1306    1
1307    1
1308    1
1309    1
Name: count, Length: 1309, dtype: int64
-----------------
Survived
0.0    549
NaN    418
1.0    342
Name: count, dtype: int64
-----------------
ticket_class
3    709
1    323
2    277
Name: count, dtype: int64
-----------------
Name
Connolly, Miss. Kate                                               2
Kelly, Mr. James                                                   2
Bonnell, Miss. Elizabeth                                           1
Peter, Master. Michael J                                           1
Braund, Mr. Owen Harris                                            1
                                                                  ..
Frolicher-Stehli, Mrs. Maxmillian (Margaretha Emerentia Stehli)    1
Larsson-Rondberg, Mr. Edvard A                                     1
Conlon, Mr. Thomas Henry                                           1
Bonnell, Miss. Caroline                                            1
Gibson, Miss. Dorothy Winifred                                     1
Name: count, Length: 1307, dtype: int64
-----------------
Sex
male      843
female    466
Name: count, dtype: int64
-----------------
Age
25.00    178
22.00    107
24.00     47
42.00     46
36.00     42
        ...
60.50      1
11.50      1
0.33       1
0.17       1
38.50      1
Name: count, Length: 99, dtype: int64
-----------------
ticket_number
CA. 2343        11
1601             8
CA 2144          8
347082           7
S.O.C. 14879     7
                ..
A.5. 3236        1
347086           1
365237           1
334915           1
28666            1
Name: count, Length: 929, dtype: int64
-----------------
Fare
8.05     60
13.00    59
7.75     55
26.00    50
7.90     49
         ..
25.74     1
27.45     1
9.32      1
12.74     1
45.50     1
Name: count, Length: 264, dtype: int64
-----------------
Embarked
S    916
C    270
Q    123
Name: count, dtype: int64
-----------------
cabin_was_missing
1    1014
0     295
Name: count, dtype: int64
-----------------
cabin_deck
F    608
G    220
D    133
E    111
C    110
B     68
A     59
Name: count, dtype: int64
-----------------
is_alone
1    790
0    519
Name: count, dtype: int64
-----------------
has_sibling_spouse_only
0    1097
1     212
Name: count, dtype: int64
-----------------
has_parents_children_only
0    1208
1     101
Name: count, dtype: int64
-----------------
has_full_family
0    1103
1     206
Name: count, dtype: int64
-----------------
age_was_missing
0    1046
1     263
Name: count, dtype: int64
-----------------
is_baby
0    1275
1      34
Name: count, dtype: int64
-----------------
is_child
0    1249
1      60
Name: count, dtype: int64
-----------------
is_teen
0    1178
1     131
Name: count, dtype: int64
-----------------
is_young_adult
1    723
0    586
Name: count, dtype: int64
-----------------
is_adult
0    981
1    328
Name: count, dtype: int64
-----------------
is_senior
0    1277
1      32
Name: count, dtype: int64
-----------------
group_size
1     713
2     264
3     147
4      64
5      35
7      35
6      24
8      16
11     11
Name: count, dtype: int64

In [55]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1309 entries, 0 to 417
Data columns (total 23 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   PassengerId                1309 non-null   int64
 1   Survived                   891 non-null    float64
 2   ticket_class               1309 non-null   int64
 3   Name                       1309 non-null   object
 4   Sex                        1309 non-null   object
 5   Age                        1309 non-null   float64
 6   ticket_number              1309 non-null   object
 7   Fare                       1309 non-null   float64
 8   Embarked                   1309 non-null   object
 9   cabin_was_missing          1309 non-null   int64
 10  cabin_deck                 1309 non-null   object
 11  is_alone                   1309 non-null   int64
 12  has_sibling_spouse_only    1309 non-null   int64
 13  has_parents_children_only  1309 non-null   int64
 14  has_full_family            1309 non-null   int64
 15  age_was_missing            1309 non-null   int64
 16  is_baby                    1309 non-null   int64
 17  is_child                   1309 non-null   int64
 18  is_teen                    1309 non-null   int64
 19  is_young_adult             1309 non-null   int64
 20  is_adult                   1309 non-null   int64
 21  is_senior                  1309 non-null   int64
 22  group_size                 1309 non-null   int64
dtypes: float64(3), int64(15), object(5)
memory usage: 245.4+ KB

Should be ready for visuals now!